Revit 2027 API
DuctSizeSettingIterator.HasCurrent Method
 Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCurrent()
Public Function HasCurrent As Boolean
public:
bool HasCurrent()
member HasCurrent : unit -> bool
Return Value
Boolean
 True if there is a current item.
See Also
Reference
DuctSizeSettingIterator Class
Autodesk.Revit.DB.Mechanical Namespace